import React from 'react';
import './Page2.css';

function Page2() {
    return (
        <div>
            <header>WHY I APPLIED</header>
            <br />
            <div className="story">
                <h1 className="title">멋쟁이 사자처럼에 지원한 동기는?</h1>
                <p className="content">안녕하세요! 저는 코딩과 웹개발에 관심이 많은 학생 조혜린입니다. <br /><br />
                어렸을 때 여러 활동에 흥미를 느끼지 못했지만,중학생이였던 시절부터 컴퓨터 게임에 흥미를 느끼며<br /><br />
                컴퓨터 자체에 관심을 가지게 되었습니다.<br /><br />
                이후 고등학생 때 웹개발자를 목표로 열심히 공부하여 명지대학교 정보통신공학과에 입학할 수 있었습니다.<br /><br />
                1학년동안 파이썬, c언어 등을 배우며 좋은 성적을 받았고 이를 통해 더욱 코딩에 흥미를 느끼고 자신감을 가지게 되었습니다. <br /><br />
                그러나 웹 개발자가 되려면 파이썬, c언어도 중요하지만 html, css 자바 스크립트를 배워야한다는 사실을 알고 있었기 때문에<br /><br />
                책을 구매하여 혼자 독학을 조금씩 하고 있었습니다. 하지만 독학으로는 턱없이 부족했고, 공부를 하면서 생기는 궁금한 점을<br /><br />
                물어볼 곳이 없었습니다. 그러다 보니 내가 만들고 있는 코드가 제대로 된 것인지, <br /><br />
                효율이 좋은 코드인지 모르는 채 공부를 하며 불안감이 커져갔습니다.<br /><br />
                그러다가 멋쟁이 사자처럼이라는 연합 동아리가 있다는 사실을 2023년 후반부쯤에 알게 되었고<br /><br />
                꼭 이 동아리에서 활동을 하고 싶고, 활동을 해야겠다는 다짐을 하게 되었습니다! 
                </p>
                <h1 className="title">마지막으로 포부 한마디</h1>
                <p className="content">제 작년 학점 성적은 4점대 중후반으로 좋은 편이라고 생각합니다. <br /><br />
                성적은 곧 성실함이기 때문에 이번년도에도 성실하게 활동에 임할 수 있습니다. <br /><br />
                작년 한해 정말 열심히 한 만큼 이번년도에는 작년보다 더욱 열심히 살고 싶습니다. <br /><br />
                멋쟁이 사자처럼에 들어가게 된다면 정말 성실하게활동에 임하겠습니다!
                </p>
        
            </div>
        </div>
    );
}

export default Page2;